"""Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному квитку з числами, 
що випали випадковим чином і в певному діапазоні під час чергового тиражу. Наприклад, 
необхідно вгадати шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.

Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), яка допоможе генерувати 
набір унікальних випадкових чисел для таких лотерей. Вона буде повертати випадковий набір чисел
у межах заданих параметрів, причому всі випадкові числа в наборі повинні бути унікальні.


Вимоги до завдання:

Параметри функції:
min - мінімальне можливе число у наборі (не менше 1).
max - максимальне можливе число у наборі (не більше 1000).
quantity - кількість чисел, які потрібно вибрати (значення між min і max).
Функція генерує вказану кількість унікальних чисел у заданому діапазоні.
Функція повертає список випадково вибраних, відсортованих чисел. 
Числа в наборі не повинні повторюватися. Якщо параметри не відповідають заданим обмеженням, 
функція повертає пустий список.


Рекомендації для виконання:

Переконайтеся, що вхідні параметри відповідають заданим обмеженням.
Використовуйте модуль random для генерації випадкових чисел.
Використовуйте множину або інший механізм для забезпечення унікальності чисел.
Пам'ятайте, що функція get_numbers_ticket повертає відсортований список унікальних чисел.
"""

import random


def get_numbers_ticket(min, max, quantity):
    # Generate a list of random unique integers.
    if min < 1 and max > 1000 and 1 > quantity > 1000:
        return []

    my_set2 = random.sample(range(min, max), quantity)
    sorted_list = sorted(my_set2)

    return sorted_list


lottery_numbers = get_numbers_ticket(1, 1000, 6)
print("Your lottery numbers: ", lottery_numbers)
